export default [
    // Понедельник:
    [],
    // Вторник:
    [
        // 1:
        [],
        // 2:
        [],
        // 3:
        [],
        // 4:
        [],
        // 5:
        [
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "П",
                teacher:   "Белокова К.И.",
                classroom: "комп.И-204-а"
            },
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "П",
                teacher:   "Белокова К.И.",
                classroom: "комп.И-204-а"
            }
        ],
        // 6:
        [
            {
                subject:   "Управление информационно-технологическими системами",
                type:      "Л",
                teacher:   "Панов А.В.",
                classroom: "ауд. А10"
            },
            {
                subject:   "Управление информационно-технологическими системами",
                type:      "Л",
                teacher:   "Панов А.В.",
                classroom: "ауд. А10"
            }
        ]
    ],
    // Среда:
    [
        // 1:
        [
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "П",
                teacher:   "Высоцкая А.А.",
                classroom: "комп. И-212-г"
            }, 
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "П",
                teacher:   "Высоцкая А.А.",
                classroom: "комп. И-212-г"
            }
        ],
        // 2:
        [
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "П",
                teacher:   "Клягин М.М.",
                classroom: "комп. В-108-1а"
            }, 
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "П",
                teacher:   "Клягин М.М.",
                classroom: "комп. В-108-1а"
            }
        ],
        // 3:
        [
            {
                subject:   "Разработка информационно-управляющих систем<br>Цифровые системы управления",
                type:      "ЛБ",
                teacher:   "Шевцов И.К.",
                classroom: "лаб. Г-307-1<br>комп. Г-403"
            },
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "ЛБ",
                teacher:   "",
                classroom: "лаб. Г-307-1"
            }
        ],
        // 4:
        [
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "Л",
                teacher:   "Мильчакова Н.Е.",
                classroom: "ауд. А-18"
            },
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "Л",
                teacher:   "Володина А.М.",
                classroom: "ауд. A-1"
            }
        ],
        // 5:
        [
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а"
            },
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а"
            }
        ],
        // 6:
        [
            {
                subject:   "Разработка информационно-управляющих систем<br>Технические средства автоматизации и управления",
                type:      "ЛБ",
                teacher:   "Дергунов А.А.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Разработка информационно-управляющих систем<br>Технические средства автоматизации и управления",
                type:      "ЛБ",
                teacher:   "Дергунов А.А.",
                classroom: "лаб. Г-307"
            }
        ]
    ],
    // Четверг:
    [
        // 1:
        [
            {
                subject:   "Технические средства автоматизации и управления",
                type:      "ЛБ",
                teacher:   "Огорельцев Р.М.",
                classroom: "лаб. Г-307"
            }, 
            {
                subject:   "Технические средства автоматизации и управления",
                type:      "ЛБ",
                teacher:   "Огорельцев Р.М.",
                classroom: "лаб. Г-307"
            }
        ],
        // 2:
        [],
        // 3:
        [
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а",
                weeks:     [0, 2, 4, 6]
            },
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а",
                weeks:     [1, 3, 5, 7]
            }
        ],
        // 4:
        [
            {
                subject:   "Технические средства автоматизации и управления",
                type:      "П",
                teacher:   "Курнасов Е.В.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Технические средства автоматизации и управления",
                type:      "П",
                teacher:   "Курнасов Е.В.",
                classroom: "лаб. Г-307"
            }
        ],
        // 5:
        [
            {
                subject:   "Технические средства автоматизации и управления",
                type:      "Л",
                teacher:   "Курнасов Е.В.",
                classroom: "ауд. А-18"
            },
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "Л",
                teacher:   "Трифонова О.А.",
                classroom: "ауд. А-10"
            }
        ],
        // 6:
        [
            {},
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "Л",
                teacher:   "Чижиков В.И.",
                classroom: "ауд. А-10"
            }
        ]
    ],
    // Пятница;
    [
        // 1:
        [
            {}, 
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "Л",
                teacher:   "",
                classroom: "ауд. Б-115"
            }
        ],
        // 2:
        [
            {}, 
            {
                subject:   "Русский язык и культура речи",
                type:      "Л",
                teacher:   "",
                classroom: "ауд. Б-115"
            }
        ],
        // 3:
        [
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "П",
                teacher:   "Килюп Л.А.",
                classroom: "комп. Г-426"
            },
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "П",
                teacher:   "",
                classroom: "комп. Г-426"
            }
        ],
        // 4:
        [
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "П",
                teacher:   "",
                classroom: "лаб. Г-307-1"
            },
            {}
        ],
        // 5:
        [
            {
                subject:   "Цифровые системы управления",
                type:      "П",
                teacher:   "Шевцов И.К.",
                classroom: "комп. Г-401-2"
            },
            {}
        ],
        // 6:
        []
    ],
    // Суббота:
    [
        // 1:
        [],
        // 2:
        [],
        // 3:
        [],
        // 4:
        [],
        // 5:
        [
            {
                subject:   "Русский язык и культура речи",
                type:      "П",
                teacher:   "",
                classroom: "ауд. А-204"
            },
            {
                subject:   "Цифровые системы управления",
                type:      "ЛБ",
                teacher:   "Шевцов И.К.",
                classroom: "комп. Г-403"
            }
        ],
        // 6:
        [
            {
                subject:   "Цифровые системы управления",
                type:      "Л",
                teacher:   "Певзнер Л.Д.",
                classroom: "ауд. А-18"
            },
            {
                subject:   "Цифровые системы управления",
                type:      "Л",
                teacher:   "Певзнер Л.Д.",
                classroom: "ауд. А-18"
            }
        ]
    ]
]
