export default [
    // Понедельник:
    [],
    // Вторник:
    [
        // 1:
        [
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "ЛБ",
                teacher:   "Томашевская В.С.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "ЛБ",
                teacher:   "Томашевская В.С.",
                classroom: "лаб. Г-307"
            }
        ],
        // 2:
        [
            {
                subject:   "Цифровые системы управления",
                type:      "ЛБ",
                teacher:   "Шевцов И.К.",
                classroom: "комп. Г-403"
            }
        ],
        // 3:
        [
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "П",
                teacher:   "Клягин М.М.",
                classroom: "комп. В-108-1"
            },
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "П",
                teacher:   "Клягин М.М.",
                classroom: "комп. В-108-1"
            }
        ],
        // 4:
        [],
        // 5:
        [
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "Л",
                teacher:   "Панов А.В.",
                classroom: "ауд. А-15"
            },
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "Л",
                teacher:   "Панов А.В.",
                classroom: "ауд. А-15"
            }
        ],
        // 6:
        [
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "Л",
                teacher:   "Мильчакова Н.Е.",
                classroom: "ауд. А-15"
            },
            {
                subject:   "Моделирование автоматизированных систем",
                type:      "Л",
                teacher:   "Чижиков В.И.",
                classroom: "ауд. А-10"
            }
        ]
    ],
    // Среда:
    [
        // 1:
        [
            {
                subject:   "Цифровые системы управления",
                type:      "Л",
                teacher:   "Певзнер Л.Д.",
                classroom: "ауд. А-11"
            },
            {
                subject:   "Цифровые системы управления",
                type:      "Л",
                teacher:   "Певзнер Л.Д.",
                classroom: "ауд. А-11"
            }
        ],
        // 2:
        [
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "Л",
                teacher:   "Володина А.М.",
                classroom: "ауд. А-16"
            },
            {
                subject:   "Русский язык и культура речи",
                type:      "Л",
                teacher:   "Ульянова Э.Ф.",
                classroom: "ауд. А-17"
            }
        ],
        // 3:
        [
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "П",
                teacher:   "Белкова К.И.",
                classroom: "комп. И-204-б"
            },
            {
                subject:   "Дизайн интерфейсов систем управления",
                type:      "П",
                teacher:   "Белкова К.И.",
                classroom: "комп. И-204-б"
            }
        ],
        // 4:
        [],
        // 5:
        [],
        // 6:
        []
    ],
    // Четверг:
    [
        // 1:
        [],
        // 2:
        [],
        // 3:
        [],
        // 4:
        [],
        // 5:
        [
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "П",
                teacher:   "Килюп Л.А.",
                classroom: "комп. А-423"
            },
            {
                subject:   "Управление информационно-технологическими проектами",
                type:      "П",
                teacher:   "Килюп Л.А.",
                classroom: "комп. А-423"
            }
        ],
        // 6:
        [
            {
                subject:   "Технологические средства автоматизации и управления",
                type:      "П",
                teacher:   "Курнаcов Е.В.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Технологические средства автоматизации и управления",
                type:      "П",
                teacher:   "Курнасов Е.В.",
                classroom: "лаб. Г-307"
            }
        ]
    ],
    // Пятница;
    [
        // 1:
        [],
        // 2:
        [],
        // 3:
        [
            {
                subject:   "Технологические средства автоматизации и управления",
                type:      "Л",
                teacher:   "Курнасов Е.В.",
                classroom: "ауд. А-17"
            },
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "Л",
                teacher:   "Митин М.П.",
                classroom: "ауд. А-17"
            }
        ],
        // 4:
        [
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "Л",
                teacher:   "Томашевская В.С.",
                classroom: "ауд. Б-115"
            }
        ],
        // 5:
        [
            {
                subject:   "Цифровые системы управления",
                type:      "П",
                teacher:   "Шевцов И.К.",
                classroom: "комп. Г-401-2"
            },
            {
                subject:   "Цифровые системы управления",
                type:      "ЛБ",
                teacher:   "Шевцов И.К.",
                classroom: "комп. Г-403"
            }
        ],
        // 6:
        [
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "ЛБ",
                teacher:   "Томашевская В.С.",
                classroom: "лаб. Г-307-1"
            },
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "ЛБ",
                teacher:   "Томашевская В.С.",
                classroom: "лаб. Г-307-1"
            }
        ]
    ],
    // Суббота:
    [
        // 1:
        [
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а"
            },
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а"
            }
        ],
        // 2:
        [
            {
                subject:   "Проектирование информационно-управляющих систем",
                type:      "П",
                teacher:   "Володина А.М.",
                classroom: "комп. В-108-1а"
            }
        ],
        // 3:
        [
            {
                subject:   "Технические средства автоматизации и управления 1 п/г",
                type:      "ЛБ",
                teacher:   "Огорельцев Р.М.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Технические средства автоматизации и управления 2 п/г",
                type:      "ЛБ",
                teacher:   "Дергунов А.А.",
                classroom: "лаб. Г-307"
            }
        ],
        // 4:
        [
            {
                subject:   "Технические средства автоматизации и управления 1 п/г",
                type:      "ЛБ",
                teacher:   "Огорельцев Р.М.",
                classroom: "лаб. Г-307"
            },
            {
                subject:   "Технические средства автоматизации и управления 2 п/г",
                type:      "ЛБ",
                teacher:   "Дергунов А.А.",
                classroom: "лаб. Г-307"
            }
        ],
        // 5:
        [
            {
                subject:   "Русский язык и культура речи",
                type:      "П",
                teacher:   "Иванова Е.И.",
                classroom: "ауд. А-107"
            },
            {
                subject:   "Разработка информационно-управляющих систем",
                type:      "П",
                teacher:   "Томашевская В.С.",
                classroom: "лаб. Г-307-1"
            }
        ],
        // 6:
        [
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "П",
                teacher:   "Деревлев Г.С.",
                classroom: "комп. Г-426"
            },
            {
                subject:   "Технологии и инструментарий анализа больших данных",
                type:      "П",
                teacher:   "Деревлев Г.С.",
                classroom: "комп. Г-426"
            }
        ]
    ]
]
